jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.h
/* GPIO_AD_B1_04 (coord L12), CURR2_B */
#define BOARD_INITADCPINS_CURR2_B_PERIPHERAL                                ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR2_B_SIGNAL                                      IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR2_B_CHANNEL                                     9U   /*!< ADC1 IN channel: 9 */
#define BOARD_INITADCPINS_CURR2_B_PIN_NAME                         GPIO_AD_B1_04   /*!< Pin name */
#define BOARD_INITADCPINS_CURR2_B_LABEL                                "CURR2_B"   /*!< Label */
#define BOARD_INITADCPINS_CURR2_B_NAME                                 "CURR2_B"   /*!< Identifier name */

/* GPIO_AD_B1_05 (coord K12), CURR2_C */
#define BOARD_INITADCPINS_CURR2_C_PERIPHERAL                                ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADCPINS_CURR2_C_SIGNAL                                      IN   /*!< ADC1 signal: IN */
#define BOARD_INITADCPINS_CURR2_C_CHANNEL                                    10U   /*!< ADC1 IN channel: 10 */
#define BOARD_INITADCPINS_CURR2_C_PIN_NAME                         GPIO_AD_B1_05   /*!< Pin name */
#define BOARD_INITADCPINS_CURR2_C_LABEL                                "CURR2_C"   /*!< Label */
#define BOARD_INITADCPINS_CURR2_C_NAME                                 "CURR2_C"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitAdcPins(void);

/* GPIO_EMC_23 (coord G2), PWM1_AT */
#define BOARD_INITPWMPINS_PWM1_AT_PERIPHERAL                                PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWMPINS_PWM1_AT_SIGNAL                                       A   /*!< PWM1 signal: A */
#define BOARD_INITPWMPINS_PWM1_AT_CHANNEL                                     0U   /*!< PWM1 A channel: 0 */
#define BOARD_INITPWMPINS_PWM1_AT_PIN_NAME                           GPIO_EMC_26   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM1_AT_LABEL                                "PWM1_AT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM1_AT_NAME                                 "PWM1_AT"   /*!< Identifier name */

/* GPIO_EMC_24 (coord D3), PWM1_AB */
#define BOARD_INITPWMPINS_PWM1_AB_PERIPHERAL                                PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWMPINS_PWM1_AB_SIGNAL                                       B   /*!< PWM1 signal: B */
#define BOARD_INITPWMPINS_PWM1_AB_CHANNEL                                     0U   /*!< PWM1 B channel: 0 */
#define BOARD_INITPWMPINS_PWM1_AB_PIN_NAME                           GPIO_EMC_27   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM1_AB_LABEL                                "PWM1_AB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM1_AB_NAME                                 "PWM1_AB"   /*!< Identifier name */

/* GPIO_EMC_25 (coord D2), PWM1_BT */
#define BOARD_INITPWMPINS_PWM1_BT_PERIPHERAL                                PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWMPINS_PWM1_BT_SIGNAL                                       A   /*!< PWM1 signal: A */
#define BOARD_INITPWMPINS_PWM1_BT_CHANNEL                                     1U   /*!< PWM1 A channel: 1 */
#define BOARD_INITPWMPINS_PWM1_BT_PIN_NAME                           GPIO_EMC_24   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM1_BT_LABEL                                "PWM1_BT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM1_BT_NAME                                 "PWM1_BT"   /*!< Identifier name */

/* GPIO_EMC_26 (coord B3), PWM1_BB */
#define BOARD_INITPWMPINS_PWM1_BB_PERIPHERAL                                PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWMPINS_PWM1_BB_SIGNAL                                       B   /*!< PWM1 signal: B */
#define BOARD_INITPWMPINS_PWM1_BB_CHANNEL                                     1U   /*!< PWM1 B channel: 1 */
#define BOARD_INITPWMPINS_PWM1_BB_PIN_NAME                           GPIO_EMC_25   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM1_BB_LABEL                                "PWM1_BB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM1_BB_NAME                                 "PWM1_BB"   /*!< Identifier name */

/* GPIO_EMC_27 (coord A2), PWM1_CT */
#define BOARD_INITPWMPINS_PWM1_CT_PERIPHERAL                                PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWMPINS_PWM1_CT_SIGNAL                                       A   /*!< PWM1 signal: A */
#define BOARD_INITPWMPINS_PWM1_CT_CHANNEL                                     2U   /*!< PWM1 A channel: 2 */
#define BOARD_INITPWMPINS_PWM1_CT_PIN_NAME                           GPIO_EMC_22   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM1_CT_LABEL                                "PWM1_CT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM1_CT_NAME                                 "PWM1_CT"   /*!< Identifier name */

/* GPIO_EMC_28 (coord D1), PWM1_CB */
#define BOARD_INITPWMPINS_PWM1_CB_PERIPHERAL                                PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPWMPINS_PWM1_CB_SIGNAL                                       B   /*!< PWM1 signal: B */
#define BOARD_INITPWMPINS_PWM1_CB_CHANNEL                                     2U   /*!< PWM1 B channel: 2 */
#define BOARD_INITPWMPINS_PWM1_CB_PIN_NAME                           GPIO_EMC_23   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM1_CB_LABEL                                "PWM1_CB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM1_CB_NAME                                 "PWM1_CB"   /*!< Identifier name */

/* GPIO_AD_B0_14, PWM2_AT */
#define BOARD_INITPWMPINS_PWM2_AT_PERIPHERAL                                PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWMPINS_PWM2_AT_SIGNAL                                       A   /*!< PWM2 signal: A */
#define BOARD_INITPWMPINS_PWM2_AT_CHANNEL                                     0U   /*!< PWM2 A channel: 0 */
#define BOARD_INITPWMPINS_PWM2_AT_PIN_NAME                         GPIO_AD_B0_14   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM2_AT_LABEL                                "PWM2_AT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM2_AT_NAME                                 "PWM2_AT"   /*!< Identifier name */

/* GPIO_AD_B0_15, PWM2_AB */
#define BOARD_INITPWMPINS_PWM2_AB_PERIPHERAL                                PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWMPINS_PWM2_AB_SIGNAL                                       B   /*!< PWM2 signal: B */
#define BOARD_INITPWMPINS_PWM2_AB_CHANNEL                                     0U   /*!< PWM2 B channel: 0 */
#define BOARD_INITPWMPINS_PWM2_AB_PIN_NAME                         GPIO_AD_B0_15   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM2_AB_LABEL                                "PWM2_AB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM2_AB_NAME                                 "PWM2_AB"   /*!< Identifier name */

