jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.h
/* GPIO_AD_B0_12, PWM2_BT */
#define BOARD_INITPWMPINS_PWM2_BT_PERIPHERAL                                PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWMPINS_PWM2_BT_SIGNAL                                       A   /*!< PWM2 signal: A */
#define BOARD_INITPWMPINS_PWM2_BT_CHANNEL                                     1U   /*!< PWM2 A channel: 1 */
#define BOARD_INITPWMPINS_PWM2_BT_PIN_NAME                         GPIO_AD_B0_12   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM2_BT_LABEL                                "PWM2_BT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM2_BT_NAME                                 "PWM2_BT"   /*!< Identifier name */

/* GPIO_AD_B0_13, PWM2_BB */
#define BOARD_INITPWMPINS_PWM2_BB_PERIPHERAL                                PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWMPINS_PWM2_BB_SIGNAL                                       B   /*!< PWM2 signal: B */
#define BOARD_INITPWMPINS_PWM2_BB_CHANNEL                                     1U   /*!< PWM2 B channel: 1 */
#define BOARD_INITPWMPINS_PWM2_BB_PIN_NAME                         GPIO_AD_B0_13   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM2_BB_LABEL                                "PWM2_BB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM2_BB_NAME                                 "PWM2_BB"   /*!< Identifier name */

/* GPIO_AD_B0_10, PWM2_CT */
#define BOARD_INITPWMPINS_PWM2_CT_PERIPHERAL                                PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWMPINS_PWM2_CT_SIGNAL                                       A   /*!< PWM2 signal: A */
#define BOARD_INITPWMPINS_PWM2_CT_CHANNEL                                     3U   /*!< PWM2 A channel: 3 */
#define BOARD_INITPWMPINS_PWM2_CT_PIN_NAME                         GPIO_AD_B0_10   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM2_CT_LABEL                                "PWM2_CT"   /*!< Label */
#define BOARD_INITPWMPINS_PWM2_CT_NAME                                 "PWM2_CT"   /*!< Identifier name */

/* GPIO_AD_B0_11, PWM2_CB */
#define BOARD_INITPWMPINS_PWM2_CB_PERIPHERAL                                PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWMPINS_PWM2_CB_SIGNAL                                       B   /*!< PWM2 signal: B */
#define BOARD_INITPWMPINS_PWM2_CB_CHANNEL                                     3U   /*!< PWM2 B channel: 3 */
#define BOARD_INITPWMPINS_PWM2_CB_PIN_NAME                         GPIO_AD_B0_11   /*!< Pin name */
#define BOARD_INITPWMPINS_PWM2_CB_LABEL                                "PWM2_CB"   /*!< Label */
#define BOARD_INITPWMPINS_PWM2_CB_NAME                                 "PWM2_CB"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPwmPins(void);

/* GPIO_EMC_35 (coord E5), ENC1_A */
#define BOARD_INITENCPINS_ENC1_A_PERIPHERAL                                 ENC1   /*!< Device name: ENC1 */
#define BOARD_INITENCPINS_ENC1_A_SIGNAL                                    PHASE   /*!< ENC1 signal: PHASE */
#define BOARD_INITENCPINS_ENC1_A_CHANNEL                                       A   /*!< ENC1 PHASE channel: A */
#define BOARD_INITENCPINS_ENC1_A_PIN_NAME                            GPIO_EMC_35   /*!< Pin name */
#define BOARD_INITENCPINS_ENC1_A_LABEL                                  "ENC1_A"   /*!< Label */
#define BOARD_INITENCPINS_ENC1_A_NAME                                   "ENC1_A"   /*!< Identifier name */

/* GPIO_EMC_36 (coord C3), ENC1_B */
#define BOARD_INITENCPINS_ENC1_B_PERIPHERAL                                 ENC1   /*!< Device name: ENC1 */
#define BOARD_INITENCPINS_ENC1_B_SIGNAL                                    PHASE   /*!< ENC1 signal: PHASE */
#define BOARD_INITENCPINS_ENC1_B_CHANNEL                                       B   /*!< ENC1 PHASE channel: B */
#define BOARD_INITENCPINS_ENC1_B_PIN_NAME                            GPIO_EMC_36   /*!< Pin name */
#define BOARD_INITENCPINS_ENC1_B_LABEL                                  "ENC1_B"   /*!< Label */
#define BOARD_INITENCPINS_ENC1_B_NAME                                   "ENC1_B"   /*!< Identifier name */

/* GPIO_EMC_37 (coord E4), ENC1_I */
#define BOARD_INITENCPINS_ENC1_I_PERIPHERAL                                 ENC1   /*!< Device name: ENC1 */
#define BOARD_INITENCPINS_ENC1_I_SIGNAL                                    INDEX   /*!< ENC1 signal: INDEX */
#define BOARD_INITENCPINS_ENC1_I_PIN_NAME                            GPIO_EMC_37   /*!< Pin name */
#define BOARD_INITENCPINS_ENC1_I_LABEL                                  "ENC1_I"   /*!< Label */
#define BOARD_INITENCPINS_ENC1_I_NAME                                   "ENC1_I"   /*!< Identifier name */

/* GPIO_EMC_13 (coord A6), ENC2_A */
#define BOARD_INITENCPINS_ENC2_A_PERIPHERAL                                 ENC2   /*!< Device name: ENC2 */
#define BOARD_INITENCPINS_ENC2_A_SIGNAL                                    PHASE   /*!< ENC2 signal: PHASE */
#define BOARD_INITENCPINS_ENC2_A_CHANNEL                                       A   /*!< ENC2 PHASE channel: A */
#define BOARD_INITENCPINS_ENC2_A_PIN_NAME                            GPIO_EMC_13   /*!< Pin name */
#define BOARD_INITENCPINS_ENC2_A_LABEL                                  "ENC2_A"   /*!< Label */
#define BOARD_INITENCPINS_ENC2_A_NAME                                   "ENC2_A"   /*!< Identifier name */

/* GPIO_EMC_14 (coord B6), ENC2_B */
#define BOARD_INITENCPINS_ENC2_B_PERIPHERAL                                 ENC2   /*!< Device name: ENC2 */
#define BOARD_INITENCPINS_ENC2_B_SIGNAL                                    PHASE   /*!< ENC2 signal: PHASE */
#define BOARD_INITENCPINS_ENC2_B_CHANNEL                                       B   /*!< ENC2 PHASE channel: B */
#define BOARD_INITENCPINS_ENC2_B_PIN_NAME                            GPIO_EMC_14   /*!< Pin name */
#define BOARD_INITENCPINS_ENC2_B_LABEL                                  "ENC2_B"   /*!< Label */
#define BOARD_INITENCPINS_ENC2_B_NAME                                   "ENC2_B"   /*!< Identifier name */

/* GPIO_B0_15 (coord E11), ENC2_I */
#define BOARD_INITENCPINS_ENC2_I_PERIPHERAL                                 ENC2   /*!< Device name: ENC2 */
#define BOARD_INITENCPINS_ENC2_I_SIGNAL                                    INDEX   /*!< ENC2 signal: INDEX */
#define BOARD_INITENCPINS_ENC2_I_PIN_NAME                             GPIO_B0_15   /*!< Pin name */
#define BOARD_INITENCPINS_ENC2_I_LABEL                                  "ENC2_I"   /*!< Label */
#define BOARD_INITENCPINS_ENC2_I_NAME                                   "ENC2_I"   /*!< Identifier name */

/* GPIO_EMC_15 (coord B1), ENC3_A */
#define BOARD_INITENCPINS_ENC3_A_PERIPHERAL                                 ENC3   /*!< Device name: ENC3 */
#define BOARD_INITENCPINS_ENC3_A_SIGNAL                                    PHASE   /*!< ENC3 signal: PHASE */
#define BOARD_INITENCPINS_ENC3_A_CHANNEL                                       A   /*!< ENC3 PHASE channel: A */
#define BOARD_INITENCPINS_ENC3_A_PIN_NAME                            GPIO_EMC_15   /*!< Pin name */
#define BOARD_INITENCPINS_ENC3_A_LABEL                                  "ENC3_A"   /*!< Label */
#define BOARD_INITENCPINS_ENC3_A_NAME                                   "ENC3_A"   /*!< Identifier name */

/* GPIO_EMC_16 (coord A5), ENC3_B */
#define BOARD_INITENCPINS_ENC3_B_PERIPHERAL                                 ENC3   /*!< Device name: ENC3 */
#define BOARD_INITENCPINS_ENC3_B_SIGNAL                                    PHASE   /*!< ENC3 signal: PHASE */
#define BOARD_INITENCPINS_ENC3_B_CHANNEL                                       B   /*!< ENC3 PHASE channel: B */
#define BOARD_INITENCPINS_ENC3_B_PIN_NAME                            GPIO_EMC_16   /*!< Pin name */
#define BOARD_INITENCPINS_ENC3_B_LABEL                                  "ENC3_B"   /*!< Label */
#define BOARD_INITENCPINS_ENC3_B_NAME                                   "ENC3_B"   /*!< Identifier name */

/* GPIO_B1_00 (coord A11), ENC3_I */
#define BOARD_INITENCPINS_ENC3_I_PERIPHERAL                                 ENC3   /*!< Device name: ENC3 */
#define BOARD_INITENCPINS_ENC3_I_SIGNAL                                    INDEX   /*!< ENC3 signal: INDEX */
#define BOARD_INITENCPINS_ENC3_I_PIN_NAME                             GPIO_B1_00   /*!< Pin name */
#define BOARD_INITENCPINS_ENC3_I_LABEL                                  "ENC3_I"   /*!< Label */
#define BOARD_INITENCPINS_ENC3_I_NAME                                   "ENC3_I"   /*!< Identifier name */

/* GPIO_B1_01 (coord B11), ENC4_A */
#define BOARD_INITENCPINS_ENC4_A_PERIPHERAL                                 ENC4   /*!< Device name: ENC4 */
#define BOARD_INITENCPINS_ENC4_A_SIGNAL                                    PHASE   /*!< ENC4 signal: PHASE */
#define BOARD_INITENCPINS_ENC4_A_CHANNEL                                       A   /*!< ENC4 PHASE channel: A */
#define BOARD_INITENCPINS_ENC4_A_PIN_NAME                             GPIO_B1_01   /*!< Pin name */
#define BOARD_INITENCPINS_ENC4_A_LABEL                                  "ENC4_A"   /*!< Label */
#define BOARD_INITENCPINS_ENC4_A_NAME                                   "ENC4_A"   /*!< Identifier name */

