jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.h
/* GPIO_B1_02 (coord C11), ENC4_B */
#define BOARD_INITENCPINS_ENC4_B_PERIPHERAL                                 ENC4   /*!< Device name: ENC4 */
#define BOARD_INITENCPINS_ENC4_B_SIGNAL                                    PHASE   /*!< ENC4 signal: PHASE */
#define BOARD_INITENCPINS_ENC4_B_CHANNEL                                       B   /*!< ENC4 PHASE channel: B */
#define BOARD_INITENCPINS_ENC4_B_PIN_NAME                             GPIO_B1_02   /*!< Pin name */
#define BOARD_INITENCPINS_ENC4_B_LABEL                                  "ENC4_B"   /*!< Label */
#define BOARD_INITENCPINS_ENC4_B_NAME                                   "ENC4_B"   /*!< Identifier name */

/* GPIO_B1_03 (coord D11), ENC4_I */
#define BOARD_INITENCPINS_ENC4_I_PERIPHERAL                                 ENC4   /*!< Device name: ENC4 */
#define BOARD_INITENCPINS_ENC4_I_SIGNAL                                    INDEX   /*!< ENC4 signal: INDEX */
#define BOARD_INITENCPINS_ENC4_I_PIN_NAME                             GPIO_B1_03   /*!< Pin name */
#define BOARD_INITENCPINS_ENC4_I_LABEL                                  "ENC4_I"   /*!< Label */
#define BOARD_INITENCPINS_ENC4_I_NAME                                   "ENC4_I"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitEncPins(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLcdPins(void);

/* GPIO_EMC_17 (coord A4), FLEXCAN1_TX */
#define BOARD_INITCANPINS_FLEXCAN1_TX_PERIPHERAL                            CAN1   /*!< Device name: CAN1 */
#define BOARD_INITCANPINS_FLEXCAN1_TX_SIGNAL                                  TX   /*!< CAN1 signal: TX */
#define BOARD_INITCANPINS_FLEXCAN1_TX_PIN_NAME                       GPIO_EMC_17   /*!< Pin name */
#define BOARD_INITCANPINS_FLEXCAN1_TX_LABEL                        "FLEXCAN1_TX"   /*!< Label */
#define BOARD_INITCANPINS_FLEXCAN1_TX_NAME                         "FLEXCAN1_TX"   /*!< Identifier name */

/* GPIO_EMC_18 (coord B2), FLEXCAN1_RX */
#define BOARD_INITCANPINS_FLEXCAN1_RX_PERIPHERAL                            CAN1   /*!< Device name: CAN1 */
#define BOARD_INITCANPINS_FLEXCAN1_RX_SIGNAL                                  RX   /*!< CAN1 signal: RX */
#define BOARD_INITCANPINS_FLEXCAN1_RX_PIN_NAME                       GPIO_EMC_18   /*!< Pin name */
#define BOARD_INITCANPINS_FLEXCAN1_RX_LABEL                        "FLEXCAN1_RX"   /*!< Label */
#define BOARD_INITCANPINS_FLEXCAN1_RX_NAME                         "FLEXCAN1_RX"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCanPins(void);

/* GPIO_B1_04 (coord E12), ENET_RX_DATA0 */
#define BOARD_INITENETPINS_ENET_RX_DATA0_PERIPHERAL                         ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_RX_DATA0_SIGNAL                     enet_rx_data   /*!< ENET signal: enet_rx_data */
#define BOARD_INITENETPINS_ENET_RX_DATA0_CHANNEL                              0U   /*!< ENET enet_rx_data channel: 0 */
#define BOARD_INITENETPINS_ENET_RX_DATA0_PIN_NAME                     GPIO_B1_04   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_RX_DATA0_LABEL                   "ENET_RX_DATA0"   /*!< Label */
#define BOARD_INITENETPINS_ENET_RX_DATA0_NAME                    "ENET_RX_DATA0"   /*!< Identifier name */

/* GPIO_B1_05 (coord D12), ENET_RX_DATA1 */
#define BOARD_INITENETPINS_ENET_RX_DATA1_PERIPHERAL                         ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_RX_DATA1_SIGNAL                     enet_rx_data   /*!< ENET signal: enet_rx_data */
#define BOARD_INITENETPINS_ENET_RX_DATA1_CHANNEL                              1U   /*!< ENET enet_rx_data channel: 1 */
#define BOARD_INITENETPINS_ENET_RX_DATA1_PIN_NAME                     GPIO_B1_05   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_RX_DATA1_LABEL                   "ENET_RX_DATA1"   /*!< Label */
#define BOARD_INITENETPINS_ENET_RX_DATA1_NAME                    "ENET_RX_DATA1"   /*!< Identifier name */

/* GPIO_B1_06 (coord C12), ENET_CRS_RV */
#define BOARD_INITENETPINS_ENET_CRS_RV_PERIPHERAL                           ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_CRS_RV_SIGNAL                         enet_rx_en   /*!< ENET signal: enet_rx_en */
#define BOARD_INITENETPINS_ENET_CRS_RV_PIN_NAME                       GPIO_B1_06   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_CRS_RV_LABEL                       "ENET_CRS_RV"   /*!< Label */
#define BOARD_INITENETPINS_ENET_CRS_RV_NAME                        "ENET_CRS_RV"   /*!< Identifier name */

/* GPIO_B1_07 (coord B12), ENET_TX_DATA0 */
#define BOARD_INITENETPINS_ENET_TX_DATA0_PERIPHERAL                         ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_TX_DATA0_SIGNAL                     enet_tx_data   /*!< ENET signal: enet_tx_data */
#define BOARD_INITENETPINS_ENET_TX_DATA0_CHANNEL                              0U   /*!< ENET enet_tx_data channel: 0 */
#define BOARD_INITENETPINS_ENET_TX_DATA0_PIN_NAME                     GPIO_B1_07   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_TX_DATA0_LABEL                   "ENET_TX_DATA0"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TX_DATA0_NAME                    "ENET_TX_DATA0"   /*!< Identifier name */

/* GPIO_B1_08 (coord A12), ENET_TX_DATA1 */
#define BOARD_INITENETPINS_ENET_TX_DATA1_PERIPHERAL                         ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_TX_DATA1_SIGNAL                     enet_tx_data   /*!< ENET signal: enet_tx_data */
#define BOARD_INITENETPINS_ENET_TX_DATA1_CHANNEL                              1U   /*!< ENET enet_tx_data channel: 1 */
#define BOARD_INITENETPINS_ENET_TX_DATA1_PIN_NAME                     GPIO_B1_08   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_TX_DATA1_LABEL                   "ENET_TX_DATA1"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TX_DATA1_NAME                    "ENET_TX_DATA1"   /*!< Identifier name */

/* GPIO_B1_09 (coord A13), ENET_TX_EN */
#define BOARD_INITENETPINS_ENET_TX_EN_PERIPHERAL                            ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_TX_EN_SIGNAL                          enet_tx_en   /*!< ENET signal: enet_tx_en */
#define BOARD_INITENETPINS_ENET_TX_EN_PIN_NAME                        GPIO_B1_09   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_TX_EN_LABEL                         "ENET_TX_EN"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TX_EN_NAME                          "ENET_TX_EN"   /*!< Identifier name */

/* GPIO_B1_10 (coord B13), ENET_TX_CLK */
#define BOARD_INITENETPINS_ENET_TX_CLK_PERIPHERAL                           ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_TX_CLK_SIGNAL                        enet_tx_clk   /*!< ENET signal: enet_tx_clk */
#define BOARD_INITENETPINS_ENET_TX_CLK_PIN_NAME                       GPIO_B1_10   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_TX_CLK_LABEL                       "ENET_TX_CLK"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TX_CLK_NAME                        "ENET_TX_CLK"   /*!< Identifier name */

/* GPIO_B1_11 (coord C13), ENET_RX_ER */
#define BOARD_INITENETPINS_ENET_RX_ER_PERIPHERAL                            ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_RX_ER_SIGNAL                          enet_rx_er   /*!< ENET signal: enet_rx_er */
#define BOARD_INITENETPINS_ENET_RX_ER_PIN_NAME                        GPIO_B1_11   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_RX_ER_LABEL                         "ENET_RX_ER"   /*!< Label */
#define BOARD_INITENETPINS_ENET_RX_ER_NAME                          "ENET_RX_ER"   /*!< Identifier name */

/* GPIO_B1_14 (coord C14), ENET_MDC */
#define BOARD_INITENETPINS_ENET_MDC_PERIPHERAL                              ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_MDC_SIGNAL                              enet_mdc   /*!< ENET signal: enet_mdc */
#define BOARD_INITENETPINS_ENET_MDC_PIN_NAME                          GPIO_B1_14   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_MDC_LABEL                             "ENET_MDC"   /*!< Label */
#define BOARD_INITENETPINS_ENET_MDC_NAME                              "ENET_MDC"   /*!< Identifier name */

/* GPIO_B1_15 (coord B14), ENET_MDIO */
#define BOARD_INITENETPINS_ENET_MDIO_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_MDIO_SIGNAL                            enet_mdio   /*!< ENET signal: enet_mdio */
#define BOARD_INITENETPINS_ENET_MDIO_PIN_NAME                         GPIO_B1_15   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_MDIO_LABEL                           "ENET_MDIO"   /*!< Label */
#define BOARD_INITENETPINS_ENET_MDIO_NAME                            "ENET_MDIO"   /*!< Identifier name */

